# 'brew tap'
tap "Homebrew/bundle"
tap "Homebrew/cask-versions"
tap "Homebrew/services"
tap "cask-fonts"

# 'brew install'
brew "mas"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "npm"
brew "tmux"
brew "tpm"
brew "wget"
brew "jq"
brew "go"
brew "terraform"
brew "awscli"
brew "colima" 
brew "ansible" 
brew "awk" 
brew "helm" 
brew "k9s" 
brew "chtf"
brew "btop"
brew "kubernetes-cli"
brew "ripgrep" 
brew "tflint" 
brew "thefuck" 
brew "pre-commit"
brew "autojump"
brew "terminal-notifier"
brew "github-keygen"

# 'brew install --cask'
cask "the-unarchiver"
cask "visual-studio-code"
cask "1password-cli"
cask '1password'
cask 'iterm2' 
cask 'google-chrome'
cask 'arc'
cask 'vagrant'
cask 'adguard'
cask 'font-hack-nerd-font'
cask 'logi-options-plus'

#'vscode --install-extension'
vscode "hashicorp.terraform"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "redhat.vscode-yaml"
vscode "ms-azuretools.vscode-docker"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "vscode-icons-team.vscode-icons"
vscode "oderwat.indent-rainbow"